c5/src/Catalogs/PaymentLocations/PaymentLocations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PaymentLocations</name>
  <owners>Catalog.Companies</owners>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Class</name>
    <type>
      <types>EnumRef.Accounts</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Enums/Accounts/Accounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Accounts</name>
  <enumValues>
    <name>AccountsPayable</name>
  </enumValues>
  <enumValues>
    <name>AccountsReceivable</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>CostOfGoodsSold</name>
  </enumValues>
  <enumValues>
    <name>CreditCard</name>
  </enumValues>
  <enumValues>
    <name>Equity</name>
  </enumValues>
  <enumValues>
    <name>Expenses</name>
  </enumValues>
  <enumValues>
    <name>FixedAssets</name>
  </enumValues>
  <enumValues>
    <name>Income</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssets</name>
  </enumValues>
  <enumValues>
    <name>LongTermLiability</name>
  </enumValues>
  <enumValues>
    <name>NonPosting</name>
  </enumValues>
  <enumValues>
    <name>OtherCurrentAssets</name>
  </enumValues>
  <enumValues>
    <name>OtherCurrentLiability</name>
  </enumValues>
  <enumValues>
    <name>OtherExpenses</name>
  </enumValues>
  <enumValues>
    <name>OtherIncome</name>
  </enumValues>
  <enumValues>
    <name>OtherLongTermAssets</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>Check</name>
  </enumValues>
  <enumValues>
    <name>Visa</name>
  </enumValues>
  <enumValues>
    <name>Mastercard</name>
  </enumValues>
  <enumValues>
    <name>AmericanExpress</name>
  </enumValues>
  <enumValues>
    <name>EFT</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>PayPal</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReport</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/PaymentLocations/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )

	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
	endif;
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	if ( Object.Owner.IsEmpty () ) then
		settings = Logins.Settings ( "Company" );
		Object.Owner = settings.Company;
	endif;
	
EndProcedure 

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Remote enable Object.Register
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

// *****************************************
// *********** Group form

&AtClient
Procedure AccountOnChange ( Item )
	
	applyAccount ();
	
EndProcedure

&AtClient
Procedure applyAccount ()
	
	account = Object.Account;
	if ( account.IsEmpty () ) then
		Object.Class = undefined;
	else
		class = DF.Pick ( account, "Class" );
		Object.Class = class;
		if ( class = PredefinedValue ( "Enum.Accounts.Cash" ) ) then
			Object.Method = PredefinedValue ( "Enum.PaymentMethods.Cash" );
		else
			Object.Method = PredefinedValue ( "Enum.PaymentMethods.Bank" );
		endif;
	endif;
	
EndProcedure 

&AtClient
Procedure RegisterOnChange ( Item )
	
	applyRegister ();

EndProcedure

&AtClient
Procedure applyRegister ()
	
	if ( not Object.Register ) then
		Object.Remote = false;
	endif;
	Appearance.Apply ( ThisObject, "Object.Register" );

EndProcedure
